In [6]:
import pandas as pd
import numpy as np

In [48]:
# Task 1: Creating Employee, Seniority, and Project DataFrames
employee_df = pd.DataFrame({
    "ID": ["A001", "A002", "A003", "A004", "A005"],
    "Name": ["John Alter", "Alice Luxumberg", "Tom Sabestine", "Nina Adgra", "Amy Johny"],
    "Gender": ["M", "F", "M", "F", "F"],
    "City": ["Paris", "London", "Berlin", "Newyork", "Madrid"],
    "Age": [25, 27, 29, 31, 30]
})

employee_df

     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

In [49]:
# seniority---
seniority_df = pd.DataFrame({
    "ID": ["A001", "A002", "A003", "A004", "A005"],
    "Designation Level": [2, 2, 3, 2, 3]
})

seniority_df

     ID  Designation Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

In [50]:
# Project Dataframes---
project_df = pd.DataFrame({
    "ID": ["A001","A002","A003","A004","A005","A002","A005","A003",
           "A001","A003","A001","A004","A004","A005"],
    "Project": ["Project 1","Project 2","Project 3","Project 4","Project 5",
                "Project 6","Project 7","Project 8","Project 9","Project 10",
                "Project 11","Project 12","Project 13","Project 14"],
    "Cost": [1002000,2000000,4500000,5500000,np.nan,
             680000,400000,350000,np.nan,300000,
             2000000,1000000,3000000,200000],
    "Status": ["Finished","Ongoing","Finished","Ongoing","Finished",
               "Failed","Finished","Failed","Ongoing","Finished",
               "Failed","Ongoing","Finished","Finished"]
})

project_df

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [51]:
# This task initializes the data and saves it into CSV files for further use----
employee_df.to_csv("Employee.csv", index=False)
seniority_df.to_csv("Seniority.csv", index=False)
project_df.to_csv("Project.csv", index=False)

In [52]:
# Task 2: Filling missing Cost values using Running Average
# A for loop is used to replace NaN values with the average of previous costs
project_df = pd.read_csv("Project.csv")

costs = project_df["Cost"].values
running_sum = 0
count = 0

for i in range(len(costs)):
    if not np.isnan(costs[i]):
        running_sum += costs[i]
        count += 1
    else:
        costs[i] = running_sum / count

project_df["Cost"] = costs
project_df

      ID     Project          Cost    Status
0   A001   Project 1  1.002000e+06  Finished
1   A002   Project 2  2.000000e+06   Ongoing
2   A003   Project 3  4.500000e+06  Finished
3   A004   Project 4  5.500000e+06   Ongoing
4   A005   Project 5  3.250500e+06  Finished
5   A002   Project 6  6.800000e+05    Failed
6   A005   Project 7  4.000000e+05  Finished
7   A003   Project 8  3.500000e+05    Failed
8   A001   Project 9  2.061714e+06   Ongoing
9   A003  Project 10  3.000000e+05  Finished
10  A001  Project 11  2.000000e+06    Failed
11  A004  Project 12  1.000000e+06   Ongoing
12  A004  Project 13  3.000000e+06  Finished
13  A005  Project 14  2.000000e+05  Finished

In [ ]:
# Task 3: Splitting Name column into First Name and Last Name

employee_df = pd.read_csv("Employee.csv")

employee_df[["First Name", "Last Name"]] = employee_df["Name"].str.split(" ", expand=True)
# The original Name column is removed after splitting
employee_df.drop(columns=["Name"], inplace=True)

employee_df

     ID Gender     City  Age First Name  Last Name
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

In [54]:
# Task 4: Merging Employee, Seniority, and Project DataFrames
# Left join is used to combine all employee-related information
import pandas as pd
import numpy as np

project_df = pd.read_csv("Project.csv")
project_df

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [ ]:
# Updated cost filling code---
costs = project_df["Cost"].values

running_sum = 0
count = 0

for i in range(len(costs)):
    if not np.isnan(costs[i]):
        running_sum += costs[i]
        count += 1
    else:
        costs[i] = running_sum / count

project_df["Cost"] = costs
project_df

      ID     Project          Cost    Status
0   A001   Project 1  1.002000e+06  Finished
1   A002   Project 2  2.000000e+06   Ongoing
2   A003   Project 3  4.500000e+06  Finished
3   A004   Project 4  5.500000e+06   Ongoing
4   A005   Project 5  3.250500e+06  Finished
5   A002   Project 6  6.800000e+05    Failed
6   A005   Project 7  4.000000e+05  Finished
7   A003   Project 8  3.500000e+05    Failed
8   A001   Project 9  2.061714e+06   Ongoing
9   A003  Project 10  3.000000e+05  Finished
10  A001  Project 11  2.000000e+06    Failed
11  A004  Project 12  1.000000e+06   Ongoing
12  A004  Project 13  3.000000e+06  Finished
13  A005  Project 14  2.000000e+05  Finished

In [56]:
project_df.to_csv("Project.csv", index=False)
print("Project.csv updated successfully")

Project.csv updated successfully

In [ ]:
# merged Employee, Seniority and Project Dataframes left join---
employee_df = pd.read_csv("Employee.csv")
seniority_df = pd.read_csv("Seniority.csv")
project_df = pd.read_csv("Project.csv")

final_df = employee_df.merge(seniority_df, on="ID", how="left")
final_df = final_df.merge(project_df, on="ID", how="left")

final_df

,ID,Name,Gender,City,Age,Designation Level,Project,Cost,Status
0,A001,John Alter,M,Paris,25,2,Project 1,1.002000e+06,Finished
1,A001,John Alter,M,Paris,25,2,Project 9,2.061714e+06,Ongoing
2,A001,John Alter,M,Paris,25,2,Project 11,2.000000e+06,Failed
3,A002,Alice Luxumberg,F,London,27,2,Project 2,2.000000e+06,Ongoing
4,A002,Alice Luxumberg,F,London,27,2,Project 6,6.800000e+05,Failed
5,A003,Tom Sabestine,M,Berlin,29,3,Project 3,4.500000e+06,Finished
6,A003,Tom Sabestine,M,Berlin,29,3,Project 8,3.500000e+05,Failed
7,A003,Tom Sabestine,M,Berlin,29,3,Project 10,3.000000e+05,Finished
8,A004,Nina Adgra,F,Newyork,31,2,Project 4,5.500000e+06,Ongoing
9,A004,Nina Adgra,F,Newyork,31,2,Project 12,1.000000e+06,Ongoing
10,A004,Nina Adgra,F,Newyork,31,2,Project 13,3.000000e+06,Finished
11,A005,Amy Johny,F,Madrid,30,3,Project 5,3.250500e+06,Finished
12,A005,Amy Johny,F,Madrid,30,3,Project 7,4.000000e+05,Finished
13,A005,Amy Johny,F,Madrid,30,3,Project 14,2.000000e+05,Finished

In [ ]:
#task5: Bonus Calculation code for employees
final_df["Bonus"] = np.where(
    final_df["Status"] == "Finished",
    final_df["Cost"] * 0.05,
    0
)
# Bonus is 5% of cost for finished Projects, Otherwise 0
final_df

,ID,Name,Gender,City,Age,Designation Level,Project,Cost,Status,Bonus
0,A001,John Alter,M,Paris,25,2,Project 1,1.002000e+06,Finished,50100.0
1,A001,John Alter,M,Paris,25,2,Project 9,2.061714e+06,Ongoing,0.0
2,A001,John Alter,M,Paris,25,2,Project 11,2.000000e+06,Failed,0.0
3,A002,Alice Luxumberg,F,London,27,2,Project 2,2.000000e+06,Ongoing,0.0
4,A002,Alice Luxumberg,F,London,27,2,Project 6,6.800000e+05,Failed,0.0
5,A003,Tom Sabestine,M,Berlin,29,3,Project 3,4.500000e+06,Finished,225000.0
6,A003,Tom Sabestine,M,Berlin,29,3,Project 8,3.500000e+05,Failed,0.0
7,A003,Tom Sabestine,M,Berlin,29,3,Project 10,3.000000e+05,Finished,15000.0
8,A004,Nina Adgra,F,Newyork,31,2,Project 4,5.500000e+06,Ongoing,0.0
9,A004,Nina Adgra,F,Newyork,31,2,Project 12,1.000000e+06,Ongoing,0.0
10,A004,Nina Adgra,F,Newyork,31,2,Project 13,3.000000e+06,Finished,150000.0
11,A005,Amy Johny,F,Madrid,30,3,Project 5,3.250500e+06,Finished,162525.0
12,A005,Amy Johny,F,Madrid,30,3,Project 7,4.000000e+05,Finished,20000.0
13,A005,Amy Johny,F,Madrid,30,3,Project 14,2.000000e+05,Finished,10000.0

In [ ]:
# Task 6: Demotion code for employees whose project status is Failed
final_df.loc[final_df["Status"] == "Failed", "Designation Level"] += 1

final_df

,ID,Name,Gender,City,Age,Designation Level,Project,Cost,Status,Bonus
0,A001,John Alter,M,Paris,25,2,Project 1,1.002000e+06,Finished,50100.0
1,A001,John Alter,M,Paris,25,2,Project 9,2.061714e+06,Ongoing,0.0
2,A001,John Alter,M,Paris,25,3,Project 11,2.000000e+06,Failed,0.0
3,A002,Alice Luxumberg,F,London,27,2,Project 2,2.000000e+06,Ongoing,0.0
4,A002,Alice Luxumberg,F,London,27,3,Project 6,6.800000e+05,Failed,0.0
5,A003,Tom Sabestine,M,Berlin,29,3,Project 3,4.500000e+06,Finished,225000.0
6,A003,Tom Sabestine,M,Berlin,29,4,Project 8,3.500000e+05,Failed,0.0
7,A003,Tom Sabestine,M,Berlin,29,3,Project 10,3.000000e+05,Finished,15000.0
8,A004,Nina Adgra,F,Newyork,31,2,Project 4,5.500000e+06,Ongoing,0.0
9,A004,Nina Adgra,F,Newyork,31,2,Project 12,1.000000e+06,Ongoing,0.0
10,A004,Nina Adgra,F,Newyork,31,2,Project 13,3.000000e+06,Finished,150000.0
11,A005,Amy Johny,F,Madrid,30,3,Project 5,3.250500e+06,Finished,162525.0
12,A005,Amy Johny,F,Madrid,30,3,Project 7,4.000000e+05,Finished,20000.0
13,A005,Amy Johny,F,Madrid,30,3,Project 14,2.000000e+05,Finished,10000.0

In [ ]:
# code for Removing employees with designation level greater than 4
final_df = final_df[final_df["Designation Level"] <= 4]

final_df

,ID,Name,Gender,City,Age,Designation Level,Project,Cost,Status,Bonus
0,A001,John Alter,M,Paris,25,2,Project 1,1.002000e+06,Finished,50100.0
1,A001,John Alter,M,Paris,25,2,Project 9,2.061714e+06,Ongoing,0.0
2,A001,John Alter,M,Paris,25,3,Project 11,2.000000e+06,Failed,0.0
3,A002,Alice Luxumberg,F,London,27,2,Project 2,2.000000e+06,Ongoing,0.0
4,A002,Alice Luxumberg,F,London,27,3,Project 6,6.800000e+05,Failed,0.0
5,A003,Tom Sabestine,M,Berlin,29,3,Project 3,4.500000e+06,Finished,225000.0
6,A003,Tom Sabestine,M,Berlin,29,4,Project 8,3.500000e+05,Failed,0.0
7,A003,Tom Sabestine,M,Berlin,29,3,Project 10,3.000000e+05,Finished,15000.0
8,A004,Nina Adgra,F,Newyork,31,2,Project 4,5.500000e+06,Ongoing,0.0
9,A004,Nina Adgra,F,Newyork,31,2,Project 12,1.000000e+06,Ongoing,0.0
10,A004,Nina Adgra,F,Newyork,31,2,Project 13,3.000000e+06,Finished,150000.0
11,A005,Amy Johny,F,Madrid,30,3,Project 5,3.250500e+06,Finished,162525.0
12,A005,Amy Johny,F,Madrid,30,3,Project 7,4.000000e+05,Finished,20000.0
13,A005,Amy Johny,F,Madrid,30,3,Project 14,2.000000e+05,Finished,10000.0

In [61]:
# Task 7: Adding Mr./Mrs. prefix to First Name
employee_df = pd.read_csv("Employee.csv")

employee_df[["First Name", "Last Name"]] = employee_df["Name"].str.split(" ", expand=True)
employee_df.drop(columns=["Name"], inplace=True)

employee_df

     ID Gender     City  Age First Name  Last Name
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

In [62]:
seniority_df = pd.read_csv("Seniority.csv")
project_df = pd.read_csv("Project.csv")

final_df = employee_df.merge(seniority_df, on="ID", how="left")
final_df = final_df.merge(project_df, on="ID", how="left")

final_df

,ID,Gender,City,Age,First Name,Last Name,Designation Level,Project,Cost,Status
0,A001,M,Paris,25,John,Alter,2,Project 1,1.002000e+06,Finished
1,A001,M,Paris,25,John,Alter,2,Project 9,2.061714e+06,Ongoing
2,A001,M,Paris,25,John,Alter,2,Project 11,2.000000e+06,Failed
3,A002,F,London,27,Alice,Luxumberg,2,Project 2,2.000000e+06,Ongoing
4,A002,F,London,27,Alice,Luxumberg,2,Project 6,6.800000e+05,Failed
5,A003,M,Berlin,29,Tom,Sabestine,3,Project 3,4.500000e+06,Finished
6,A003,M,Berlin,29,Tom,Sabestine,3,Project 8,3.500000e+05,Failed
7,A003,M,Berlin,29,Tom,Sabestine,3,Project 10,3.000000e+05,Finished
8,A004,F,Newyork,31,Nina,Adgra,2,Project 4,5.500000e+06,Ongoing
9,A004,F,Newyork,31,Nina,Adgra,2,Project 12,1.000000e+06,Ongoing
10,A004,F,Newyork,31,Nina,Adgra,2,Project 13,3.000000e+06,Finished
11,A005,F,Madrid,30,Amy,Johny,3,Project 5,3.250500e+06,Finished
12,A005,F,Madrid,30,Amy,Johny,3,Project 7,4.000000e+05,Finished
13,A005,F,Madrid,30,Amy,Johny,3,Project 14,2.000000e+05,Finished

In [ ]:
import numpy as np
# Adding Mr and Mrs prefix---
final_df["First Name"] = np.where(
    final_df["Gender"] == "M",
    "Mr. " + final_df["First Name"],
    "Mrs. " + final_df["First Name"]
)

final_df

,ID,Gender,City,Age,First Name,Last Name,Designation Level,Project,Cost,Status
0,A001,M,Paris,25,Mr. John,Alter,2,Project 1,1.002000e+06,Finished
1,A001,M,Paris,25,Mr. John,Alter,2,Project 9,2.061714e+06,Ongoing
2,A001,M,Paris,25,Mr. John,Alter,2,Project 11,2.000000e+06,Failed
3,A002,F,London,27,Mrs. Alice,Luxumberg,2,Project 2,2.000000e+06,Ongoing
4,A002,F,London,27,Mrs. Alice,Luxumberg,2,Project 6,6.800000e+05,Failed
5,A003,M,Berlin,29,Mr. Tom,Sabestine,3,Project 3,4.500000e+06,Finished
6,A003,M,Berlin,29,Mr. Tom,Sabestine,3,Project 8,3.500000e+05,Failed
7,A003,M,Berlin,29,Mr. Tom,Sabestine,3,Project 10,3.000000e+05,Finished
8,A004,F,Newyork,31,Mrs. Nina,Adgra,2,Project 4,5.500000e+06,Ongoing
9,A004,F,Newyork,31,Mrs. Nina,Adgra,2,Project 12,1.000000e+06,Ongoing
10,A004,F,Newyork,31,Mrs. Nina,Adgra,2,Project 13,3.000000e+06,Finished
11,A005,F,Madrid,30,Mrs. Amy,Johny,3,Project 5,3.250500e+06,Finished
12,A005,F,Madrid,30,Mrs. Amy,Johny,3,Project 7,4.000000e+05,Finished
13,A005,F,Madrid,30,Mrs. Amy,Johny,3,Project 14,2.000000e+05,Finished

In [64]:
# Gender column is removed after updating name
final_df.drop(columns=["Gender"], inplace=True)
final_df

,ID,City,Age,First Name,Last Name,Designation Level,Project,Cost,Status
0,A001,Paris,25,Mr. John,Alter,2,Project 1,1.002000e+06,Finished
1,A001,Paris,25,Mr. John,Alter,2,Project 9,2.061714e+06,Ongoing
2,A001,Paris,25,Mr. John,Alter,2,Project 11,2.000000e+06,Failed
3,A002,London,27,Mrs. Alice,Luxumberg,2,Project 2,2.000000e+06,Ongoing
4,A002,London,27,Mrs. Alice,Luxumberg,2,Project 6,6.800000e+05,Failed
5,A003,Berlin,29,Mr. Tom,Sabestine,3,Project 3,4.500000e+06,Finished
6,A003,Berlin,29,Mr. Tom,Sabestine,3,Project 8,3.500000e+05,Failed
7,A003,Berlin,29,Mr. Tom,Sabestine,3,Project 10,3.000000e+05,Finished
8,A004,Newyork,31,Mrs. Nina,Adgra,2,Project 4,5.500000e+06,Ongoing
9,A004,Newyork,31,Mrs. Nina,Adgra,2,Project 12,1.000000e+06,Ongoing
10,A004,Newyork,31,Mrs. Nina,Adgra,2,Project 13,3.000000e+06,Finished
11,A005,Madrid,30,Mrs. Amy,Johny,3,Project 5,3.250500e+06,Finished
12,A005,Madrid,30,Mrs. Amy,Johny,3,Project 7,4.000000e+05,Finished
13,A005,Madrid,30,Mrs. Amy,Johny,3,Project 14,2.000000e+05,Finished

In [ ]:
# Task 8: Promoting employees based on Age using if condition
# If Age is greater than 29, designation level is reduced by 1
for i in range(len(final_df)):
    if final_df.loc[i, "Age"] > 29:
        final_df.loc[i, "Designation Level"] -= 1

final_df

,ID,City,Age,First Name,Last Name,Designation Level,Project,Cost,Status
0,A001,Paris,25,Mr. John,Alter,2,Project 1,1.002000e+06,Finished
1,A001,Paris,25,Mr. John,Alter,2,Project 9,2.061714e+06,Ongoing
2,A001,Paris,25,Mr. John,Alter,2,Project 11,2.000000e+06,Failed
3,A002,London,27,Mrs. Alice,Luxumberg,2,Project 2,2.000000e+06,Ongoing
4,A002,London,27,Mrs. Alice,Luxumberg,2,Project 6,6.800000e+05,Failed
5,A003,Berlin,29,Mr. Tom,Sabestine,3,Project 3,4.500000e+06,Finished
6,A003,Berlin,29,Mr. Tom,Sabestine,3,Project 8,3.500000e+05,Failed
7,A003,Berlin,29,Mr. Tom,Sabestine,3,Project 10,3.000000e+05,Finished
8,A004,Newyork,31,Mrs. Nina,Adgra,1,Project 4,5.500000e+06,Ongoing
9,A004,Newyork,31,Mrs. Nina,Adgra,1,Project 12,1.000000e+06,Ongoing
10,A004,Newyork,31,Mrs. Nina,Adgra,1,Project 13,3.000000e+06,Finished
11,A005,Madrid,30,Mrs. Amy,Johny,2,Project 5,3.250500e+06,Finished
12,A005,Madrid,30,Mrs. Amy,Johny,2,Project 7,4.000000e+05,Finished
13,A005,Madrid,30,Mrs. Amy,Johny,2,Project 14,2.000000e+05,Finished

In [ ]:
# Task 9:  Group by ID and First Name to get total cost
total_cost_df = final_df.groupby(
    ["ID", "First Name"]
)["Cost"].sum().reset_index()

# Calculating total project cost for each employee
total_cost_df.rename(columns={"Cost": "Total Cost"}, inplace=True)

total_cost_df

     ID  First Name    Total Cost
0  A001    Mr. John  5.063714e+06
1  A002  Mrs. Alice  2.680000e+06
2  A003     Mr. Tom  5.150000e+06
3  A004   Mrs. Nina  9.500000e+06
4  A005    Mrs. Amy  3.850500e+06

In [67]:
# Task 10: Filtering employees whose city name contains letter 'o'
# Case-insensitive string matching is used
city_o_df = final_df[final_df["City"].str.contains("o", case=False)]

city_o_df

,ID,City,Age,First Name,Last Name,Designation Level,Project,Cost,Status
3,A002,London,27,Mrs. Alice,Luxumberg,2,Project 2,2000000.0,Ongoing
4,A002,London,27,Mrs. Alice,Luxumberg,2,Project 6,680000.0,Failed
8,A004,Newyork,31,Mrs. Nina,Adgra,1,Project 4,5500000.0,Ongoing
9,A004,Newyork,31,Mrs. Nina,Adgra,1,Project 12,1000000.0,Ongoing
10,A004,Newyork,31,Mrs. Nina,Adgra,1,Project 13,3000000.0,Finished